source/about/justin-gordon-resume-1990s.html
---
layout: page
title: "Justin Gordon Resume 1990s"
date: 2013-05-07 00:48
comments: true
sharing: true
footer: true
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Digital Workforce</h2>
<div class="outline-text-2" id="text-1">
<p>
1998-2000, San Francisco, CA, Co-Founder, CTO
</p>

<ul class="org-ul">
<li>Co-designed and wrote a three-tier Java/HTML/SilverStream application to
manage the hiring process for beta customer Siebel Systems. Product modeled a
closed-loop hiring process, akin to a sales process. Company sold to Extensity
in August 2000.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Infoscape</h2>
<div class="outline-text-2" id="text-2">
<p>
1996-1998, San Francisco, CA, Senior Software Engineer
</p>

<ul class="org-ul">
<li>Developed major areas of Fresco, 3-tier web-deployment Java database
development tool. Contributed to 3 major releases. Reported and fixed over
200% more bugs than any other developer. Fresco named a 1997 JavaWorld
finalist for application development tools.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Mellon Capital</h2>
<div class="outline-text-2" id="text-3">
<p>
1994-1996, San Francisco, CA, Senior Associate, Research Department
</p>
<ul class="org-ul">
<li>Quantitative investment research programming.
</li>
<li>Designed and developed portfolio analysis software for taxable accounts. Program
calculated tax impact of hypothetical trades. $400 million (5/99) invested in strategy.
</li>
<li>Established technology infrastructure of the research department, including
C++ object libraries, a generic application framework, and data warehouses of
global financial data.
</li>
<li>Conducted research on currency hedging, tactical asset allocation, and stock
selection.
</li>
</ul>

<p>
1999, Consultant to Asset Allocation Department
</p>
<ul class="org-ul">
<li>Gathered requirements, designed, and wrote a global asset allocation
performance reporting system, using PowerBuilder and Sybase. Conducted an
exhaustive functional requirement analysis and process inventory for global
asset allocation.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">ACI (now called 4D)</h2>
<div class="outline-text-2" id="text-4">
<p>
1993 ACI US Cupertino, CA, Database Programming Instructor (4D)
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">GMO</h2>
<div class="outline-text-2" id="text-5">
<p>
1991-1992, Boston, MA, Investment Applications Programmer
</p>
<ul class="org-ul">
<li>Analyzed, designed, developed, and implemented portfolio management databases,
fund management reports, and institutional trading systems using 4th Dimension.
</li>
</ul>
</div>
</div>
